# Провести дисперсионный анализ для определения того, есть ли различия среднего роста среди
# взрослых футболистов, хоккеистов и штангистов. Даны значения роста в трех группах
# случайно выбранных спортсменов: Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
# Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
# Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.

k = 3
n1 = 8
n2 = 9
n3 = 11
n = n1 + n2 + n3
print(n)
# 28
y1 = (173 + 175 + 180 + 178 + 177 + 185 + 183 + 182) / n1
print(y1)
# 179.125
y2 = (177 + 179 + 180 + 188 + 177 + 172 + 171 + 184 + 180) / n2
print(y2)
# 178.66666666666666
y3 = (172 + 173 + 169 + 177 + 166 + 180 + 178 + 177 + 172 + 166 + 170) / n3
print(y3)
# 172.72727272727272
Y = (
            173 + 175 + 180 + 178 + 177 + 185 + 183 + 182 + 177 + 179 + 180 + 188 + 177 + 172 + 171 + 184 + 180 + 172 + 173 + 169 + 177 + 166 + 180 + 178 + 177 + 172 + 166 + 170) / n
print(Y)
# 176.46428571428572
S_sum = (((y1 - Y) ** 2) * n1) + (((y2 - Y) ** 2) * n2) + (((y3 - Y) ** 2) * n3)
print(S_sum)
# 253.9074675324678
S_ost = ((173 - y1) ** 2) + ((175 - y1) ** 2) + ((180 - y1) ** 2) + ((178 - y1) ** 2) + ((177 - y1) ** 2) + (
        (185 - y1) ** 2) + ((183 - y1) ** 2) + ((182 - y1) ** 2) + ((177 - y2) ** 2) + ((179 - y2) ** 2) + (
                (180 - y2) ** 2) + ((188 - y2) ** 2) + ((177 - y2) ** 2) + ((172 - y2) ** 2) + ((171 - y2) ** 2) + (
                (184 - y2) ** 2) + ((180 - y2) ** 2) + ((172 - y3) ** 2) + ((173 - y3) ** 2) + ((169 - y3) ** 2) + (
                (177 - y3) ** 2) + ((166 - y3) ** 2) + ((180 - y3) ** 2) + ((178 - y3) ** 2) + ((177 - y3) ** 2) + (
                (172 - y3) ** 2) + ((166 - y3) ** 2) + ((170 - y3) ** 2)
print(S_ost)
# 577.0568181818181
S = S_sum + S_ost
print(S)
# 830.9642857142859
G_sum = S_sum / (k - 1)
print(G_sum)
# 126.9537337662339
G_ost = S_ost / (n - k)
print(G_ost)
# 23.082272727272724
F = G_sum / G_ost
print(F)
# 5.500053450812599
df_m = k - 1
print(df_m)
# 2
df_v = n - k
print(df_v)
# 25
F_krit = 3,38
# 5.500053450812599 > 3,38

import numpy as np
from scipy import stats

y1 = np.array([173, 175, 180, 178, 177, 185, 183, 182])
y2 = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180])
y3 = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170])
F = stats.f_oneway(y1, y2, y3)
print(F)
# F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698694)
# Н0 - различий нет
# Н1 - различия есть
# если pvalue < 5% значит принимаем гипотезу Н1